{
  "components":[
    {
      "id":"ram",
      "name": "ram",
	    "image": "ram.JPG",
      "smallDescription": "ذاكرة الوصول العشوائي بالإنجليزية (Random Access Memory) ويرمز لها اختصاراً بـ RAM، وهي الذاكرة المؤقّتة المستخدمة في تخزين البيانات في الحواسيب، وسميّت بالمؤقّتة نظراً لأنّها تفقد المعلومات والبيانات المخزّنة عليها فور انقطاع التيار الكهربائيّ عنها.",
      "description": "<h2>ذاكرة الوصول العشوائي</h2><p>ذاكرة الوصول العشوائي بالإنجليزية (Random Access Memory) ويرمز لها اختصاراً بـ RAM، وهي الذاكرة المؤقّتة المستخدمة في تخزين البيانات في الحواسيب، وسميّت بالمؤقّتة نظراً لأنّها تفقد المعلومات والبيانات المخزّنة عليها فور انقطاع التيار الكهربائيّ عنها.</p><h2>الوظيفة</h2><p>تؤدّي ذاكرة الوصول العشوائيّ دوراً هامّاً في أداء البرامج، إذ تعمل على الكشف عن المساحة التي يحتاجها البرنامج في ذاكرة الحاسوب لتخزينه عليها، ويلجأ المحترفون عادةً إلى استخدام أكثر أنواع الذاكرة المؤقّتة سِعةً في التخزين نظراً لتعقيد البرامج التي يستخدمونها وما تحتاجه من سعة تخزينيّة كبيرة، وليكون لديهم القدرة أيضاً على زيادة سعتها التخزينية.</p><h2>التسمية ومبدأ العمل</h2><p>سمّيت ذاكرة الوصول العشوائي بهذا الاسم بسبب إمكانيّة وصول المستخدم إلى الخلية المطلوبة بشكلٍ مباشرٍ وعشوائي دون الحاجة إلى التسلسل في الخلايا الموجودة على الذاكرة، وتختلف هذه الذاكرة عن ذاكرة الوصول التسلسلي في مبدأ العمل؛ إذ تشترط الأخيرة ضرورة التسلسل الكامل في الخلايا التخزينية والمرور بها واحدة تلو الأخرى للوصول للخلية المطلوبة، بينما تعمل ذاكرة RAM على مبدأ التقسيم إلى عدّة مواقع؛ ليتمّ تخزين المعلومات والبيانات في مواقع وخلايا خاصّة بها تحمل عنواناً خاصاً بها، فيتم الوصول إلى المعلومة المخزنة فيها بشكل مباشر وفقاً للعنوان الخاص بها، وفي حال الافتقار لعنوان خاصّ بالموقع، فإنّ ذلك سيفرض على المستخدم البحث في كافّة المواقع للوصول إلى المعلومة المراد الحصول عليها.</p><h2> مكوّنات ذاكرة الوصول العشوائي</h2><p>تتكوّن ذاكرة الوصول العشوائي من ملايين الخلايا المكوّنة من قِبل الترانزستورات والمكثفات والتي تشكل بمجموعها دائرة متكاملة من الرقائق، ويؤدي كل منهما وظيفة خاصة به. تؤدي المكثفات دوراً هاماً في ذاكرة الوصول العشوائي؛ حيث يتم تخزين الرقم أو الرمز عليها على شكل Bit وبالتالي يتم الاحتفاظ بقيمة المعلومات فيها، أما دور الترانزيستور فيتمثل بدوره كمفتاح يتحكم بحالة المعلومات المخزنة، فإما أن تتم القراءة للحالة التي يكون عليها المكثف أو تغييرها، كما يعمل الترانزيستور الواحد على تشكيل خلية واحدة فقط من خلايا الذاكرة التي تساوي بت واحداً من البيانات المخزّنة، والبت هي الوحدة الأصغر بين وحدات القياس المستخدمة في الذاكرة، وتقاس سعتها بالميجابايت.</p><h2> أنواع ذاكرة الوصول العشوائي</h2><p>ذاكرة الوصول العشوائي الديناميكية المتزامنة ذات النقل الأحادي، بالإنجليزيةSingle Data Rate Random Acces) Memory) ويرمز لها اختصاراً بـ SD-RAM، يؤدي هذا النوع دوراً هاماً في نقل البيانات بسرعة مقبولة، إلا أنّ عيوبها تكمن بالاستهلاك الكبير للطاقة. ذاكرة الوصول العشوائي الديناميكية المتزامنة ذات النقل الثنائي، بالإنجليزيةDual Data Rate Synchronous Dynamic) Random Access) ويرمز لها اختصاراً بـ DD- RAM، يؤدي هذا النوع دوراً أكثر أهمية من النوع السابق، إذ تقدم للمستخدم إمكانية نقل البيانات بمعدل 2بت / الثانية الواحدة، وتنفرد بقدرتها على تقديم عرض محزم مضاعف للمستخدم، وتوفيرها للطاقة المستخدمة. الخطوط الديناميكية لذاكرة الوصول العشوائي،(Rambus Dynamic Random Access Memory) ويرمز لها اختصاراً بـ RD- RAM، يمتاز هذا النوع بالسرعة العالية جداً، إلّا أنّ ثمنها مرتفع أيضاً، وتستند في أداء عملها على مبدأ توزيع نقل البيانات بين المعالج والذاكرة على أكثر من قناة من خلال تصغير حجم الناقل الأمامي إلى 16 بت، ليصار إلى توزيعه بالتوازي على أكثر من قناة.</p>",
      "objFile": "Ram.obj",
      "mtlFile": "Ram.mtl"
    },
    {
      "id":"floppy-disk",
      "name": "floppy disk",
	    "image": "floppy-desk.JPG",
      "smallDescription": "هو جهاز لتخزين البيانات، يتألف من قطعة دائرية رفيعة مرنة (من هنا جاء الاسم) من مادة مغنطيسية مغلفة ضمن حافظة بلاستيكية مربعة او دائرية. تتم قراءة و كتابة البيانات إلى القرص المرن باستخدام سواقة اقراص مرنة. هي عبارة عن وسائط تخزينية ظهرت في الثمانينات والتسعينيات من القرن المنصرم",
      "description": "<h2>القرص المرن floppy desk </h2><p>هو جهاز لتخزين البيانات، يتألف من قطعة دائرية رفيعة مرنة (من هنا جاء الاسم) من مادة مغنطيسية مغلفة ضمن حافظة بلاستيكية مربعة او دائرية. تتم قراءة و كتابة البيانات إلى القرص المرن باستخدام سواقة اقراص مرنة. هي عبارة عن وسائط تخزينية ظهرت في الثمانينات والتسعينيات من القرن المنصرم، وكانت تستخدم لنقل البيانات صغيرة الحجم بين الأجهزة، ويوجد منها عدة أحجام إلا أن الحجم 3.5 انش هو الأكثر انتشاراً بينها، وتبلغ سعته التخزينية 1.44 ميغابايت، وكانت هذه الأقراص سريعة العطب، وسرعتها محدودة، ومع زيادة الحاجة إلى سعات تخزينية أكبر لتخزين الملفات والصور والمستندات والفيديو وخلافه، ظهرت وسائط تخزين جديدة بمساحات كبيرة وصلت لأكثر من 1 تيرابايت في البداية ظهور الأقراص المرنة كانت كبيرة الحجم للغاية، فظهرت أقراص 8 انش، وكانت تستخدم من قبل الشركات لتخزين البيانات وكانت كمية البيانات التي تستوعبها قليلة للغاية، ومع الوقت زادت سعتها قليلاً إلا أنها بقيت محدودة، ثم ظهرت أقراص 5 انش، وكانت بداية انتشار الأقراص المرنة بين الأفراد وليس الشركات فحسب، وكانت تستخدم كقرص لتخزين نظام الدوس وبعض البرامج الأخرى، ووصلت سعتها التخزينية إلى 1.2 ميغابايت، وأخيراً أقراص الـ 3.5 انش والتي انتشرت بشكل كبير بين الناس وكانت سعتها كما ذكرنا سابقاً 1.44 ميغابايت. كما يمكنك شراء مشغل أقراص مرنة خارجي ، يعمل من خلال الـ USB لاستخراج البيانات من أجهزة الكمبيوتر المكتبية التي لا تتوفر على مشغلات للأقراص المرنة. </p><h2> مكونات الأقراص المرنة: </h2><ul><li>أداة عمل Lock لمنع القراءة أو الكتابة على القرص.</li><li>غطاء القرص الممغنط.</li><li>أداة لحماية القرص وبنفس الوقت تتيح للكمبيوتر قراءة البيانات من القرص.</li><li>الغطاء البلاستيكي لحماية القرص.</li><li> واقي من الورق أو القماش الناعم.</li><li>القرص الممغنط.</li><li>مقطع من إحدى مسارات القرص الممغنط. </li></ul><p>اما كيفية الكتابة على القرص المرن، فهي تحدث عندما يحتك رأس ممغنط القراءة والكتابة بالطبقة الممغنطة، فينتج عن ذلك كتابة البيانات على القرص وحفظها.  </p>",
      "objFile": "floppy.obj",
      "mtlFile": "floppy.mtl"
    },
    {
      "id":"power-supply",
      "name": "power supply",
  	  "image": "power-supply.JPG",
      "smallDescription": "ما هو إلا جهاز الكتروني يعمل بالتيار الكهربائي العادي ال 220 فولت او 110 فولت في بعض الاماكن الأخرى غير مصر ويتم وصله بالتيار عن طريق كابل عادة يكون أسود اللون وبمجرد دخول الكهرباء له يبدا هذا الجهاز بإخراج قيم مختلفة للتيار الكهربائي ليمد اجزاء الكمبيوتر من الداخل بالطاقة الكهربائية",
      "description": "<h2>الباور سبلاي</h2><p>ما هو إلا جهاز الكتروني يعمل بالتيار الكهربائي العادي ال 220 فولت او 110 فولت في بعض الاماكن الأخرى غير مصر ويتم وصله بالتيار عن طريق كابل عادة يكون أسود اللون وبمجرد دخول الكهرباء له يبدا هذا الجهاز بإخراج قيم مختلفة للتيار الكهربائي ليمد اجزاء الكمبيوتر من الداخل بالطاقة الكهربائية .. فهو يخرج قيم مختلفة للجهد الكهربائي مثل 5 فولت و12 فولت بالموجب والسالب ويخرج أيضا مجموعة أخرى من فروق الجهد</p> <h2>مكوناته</h2><p>يحتوي الباور سبلاي على مروحة تبريد هامة جدا تعمل على تبريد مجموعة من الترانزستورات الحساسة والموجودة على قوالب معدنية لمحاولة التقليل من حرارتها باستمرار لأنه بطبيعة عملها تصل لدرجات حرارة عالية .. وتعمل مروحة التبريد أيضا على تبريد مختلف الأجزاء الداخلية للباور سبلاي مثل محول الكهرباء الموجود ايضا من مكونات الباور سبلاي ويجب المحافظة على سلامة هذه المروحة خاصة في أوقات الصيف لكي تبقى أجزاء الباور سبلاي محمية من درجات الحرارة العالية</p><h2>طريقة العمل بشكل عام </h2><p>عند دخول التيار الكهربائي يمر بمجموعة ديودات ( 4 ديودات ) تدعى بريدج وهي تحول التيار الكهربائي من متردد الى تيار متسمر .. ومن ثم تدخل على مكثف أو مكثفين ويختلف عددهم باختلاف قيمة الجهد الداخل سواء كان 220 او 110 ومن ثم على الترانزستورات لتحدد قيم مختلفة للجهد الكهربائي وبعد ذلك وفي النهاية تمر الجهود المختلفة للتيار على مجموعة مكثفات كثيرة وقيمها مختلفةتعمل هذه المكثفات على تنعيم وتحديد مقادير الجهود المختلفة الكثيرة التي ستخرج بعد ذلك لأجزاء الكمبيوتر الداخلية المختلفة مثل الهارد واللوحة الأم وغيرها من الأجزاء</p><h2>صيانة الباور سبلاي </h2><p>كمن تحديدا في المحافظة على المروحة تعمل دائما .. او بتغيير أحد الترانزستورات التي عادة ما تدمر بشكل مفاجىء أو سريع وايضا تشمل الصيانة تغيير مجموعات المكثفات الموجودة قبل الخرج النهائي لأنها عادة ما تتغير قيمتها بعد فترة طويلة من العمل</p>",
      "objFile": "power-supply1.obj",
      "mtlFile": "power-supply1.mtl"
    },
    {
      "id":"cd-dvd-room",
      "name": "cd-dvd room",
	    "image": "cd-dvd-room.JPG",
      "smallDescription": "أو القرص الليزري أو التخزين الضوئي ويسمى بالإنجليزية دي في دي أو قرص مضغوط هو أحد أجزاء الحاسوب الشخصي المحمول أو المكتبي ويعتبر من وسائل التخزين الموثوقة والسهلة وتمتاز بسهولة نسخ البينات واسترجاعها بالمقارنة بوسائل التخزين المغناطيسية وتتم عملية التخزين بواسطة شعاع من الليزر لأحداث علامات على سطح القرص الضوئي بواسطة روؤس الكتابة على السطح البلاستيكي للقرص ، وتتم القراءة بواسطة روؤس القراءة بواسطة تسليط شعاع ضوئي وانعكاسه من على سطح القرص . وكانت البداية مكلفة جدا أجهزة معقدة تسمى افران حفر الاقراص الليزرية.",
      "description": "<h2>محرك القرص الضوئي</h2><p> أو القرص الليزري أو التخزين الضوئي ويسمى بالإنجليزية دي في دي أو قرص مضغوط هو أحد أجزاء الحاسوب الشخصي المحمول أو المكتبي ويعتبر من وسائل التخزين الموثوقة والسهلة وتمتاز بسهولة نسخ البينات واسترجاعها بالمقارنة بوسائل التخزين المغناطيسية وتتم عملية التخزين بواسطة شعاع من الليزر لأحداث علامات على سطح القرص الضوئي بواسطة روؤس الكتابة على السطح البلاستيكي للقرص ، وتتم القراءة بواسطة روؤس القراءة بواسطة تسليط شعاع ضوئي وانعكاسه من على سطح القرص . وكانت البداية مكلفة جدا أجهزة معقدة تسمى افران حفر الاقراص الليزرية.</p><h2>وتقسم هذه المحركات إلى أنواع حسب السرعة والتقنية</h2><p> في القراءة والكتابة حيث تقاس بوحدة كيلوبايت في الثانية (KByte/s) حيث كل سرعة تعادل 300 كيلو لكل ثانية لذلك سرعتين أو اربع...أو (56X) هي سرعات القراءة أو الكتابة لذلك المحرك</p><h2>ومن حيث التقنيه </h2><p>CD-R هي أولى أنواع السواقات وهي قارئة فقط للاقراص ذات سعة تخزينة حتى 700 ميغا بايت (COMPACT DISK READ ONLY MEMORY) CD R/W محرك للأقراص وهي قادرة على القراءه و الكتابة على الاقراص (COMPACT DISK READ WRITE) قرص مضغوط قابل لإعادة الكتابة محرك قادرة على إعادة النسخ على الاقراص إذا كانت الاقراص من النوع القابل لاعادة الكتابة بعد حذف المعلومات السابقة(COMPACT DISK RE-WRITEABLE) دي في دي هي جيل جديد من محركات الأقراص ذات سعات تخزين تصل إلى 4.7 جيجا بايت وهو للقراءة فقط (DIGITAL VEDIO DISK READ ONLY MEMORY) DVD RAM هي الاصدار التالي بعد سواقة () وهي قابلة للقراءة والكتابة على أقراص()(DIGITAL VEDIO DISK RANDOM ACCESS MEMORY). DVD RW RAM هي سواقة قابلة للكتابة واعادة الكتابة على اقراص دي في دي بشرط أن تكون من النوع الذي يدعم اعادة الكتابة (DIGITAL VEDIO DISK RE-WRITEABLE RANDOM ACCESS MEMORY)</p>",
      "objFile": "cd-dvd-room.obj",
      "mtlFile": "cd-dvd-room.mtl"
    },
	{
      "id":"motherboard",
      "name": "motherboard",
	    "image": "motherboard.JPG",
      "smallDescription": "وهي تعتبر لوحة إلكترونية تسمى أيضاً باللوحة الأم “Mother Board” حيث تتصل بها كل مكونات الحاسوب لأنه يعتبر دورها الأساسي ربط مكونات الحاسوب مع بعضها البعض سواء كانت هذه المكونات هي هاردوير او سوفت وير ",
      "description": "<h2>اللوحة الأم MotherBoard</h2><p>وهي تعتبر لوحة إلكترونية تسمى أيضاً باللوحة الأم “Mother Board” حيث تتصل بها كل مكونات الحاسوب لأنه يعتبر دورها الأساسي ربط مكونات الحاسوب مع بعضها البعض سواء كانت هذه المكونات هي هاردوير او سوفت وير ، كما أنها تقوم بوصل جميع هذه المكونات مع بعضها البعض وتنظم عملها وتنظم نقل البيانات فيما بينها ، و هي التي تقوم بعملية تعريف نظام التشغيل بمكونات الحاسوب ، و أيضاً هي التي تحدد نوع المعالج الذي يجب استخدامه والذاكرة العشوائية ( الرامات ) الذي يمكن تركيبها في الحاسوب و لذلك فهي تعتبر المتحكم في السرعة التي يعمل به الحاسوب وفقاً للمكونات المتصلة به من معالج وغيره وبعد كل تلك الأشياء التي تستطيع اللوحة الأم ان تقوم بها فهي تعتبر الأمر والنهي من بعدك في إعطاء الأوامر لكل ملحقات الحاسوب</p><h2>فوائد ووظائف اللوحة الأم </h2><p>تسمح بتبادل البيانات بين جميع أجزاء الحاسوب لذلك تجد إن اي جهاز تقوم بتوصيله بالحاسوب يعمل بطريقة متوافقة مع الأجهزة الأخري.</p><p>تقوم بعمليات الإخراج والإدخال الأساسية من وإلى القرص الصلب أو إلي أي جهاز متصل بالحاسوب.</p><p>هي التي تحدد مدى قابلية الجهاز للتحديث من أجل زيادة سرعته وقدراته في المستقبل فلا يمكنك ان تقوم بترقية أحد أجزاء حاسوبك دون معرفة إذا كانت تلك القطعة متوافقة مع اللوحة الأم أو لا لذلك ننصحك بقراءة موضوع تجميع جهاز متوافق.</p><p>تحدد نوعية الأجهزة الملحقة التي نستطيع تركيبها فلا يمكننا توصيل أجهزة لا تتناسب مع اللوحة الأم ربما تعمل ولكن ليس بالكفائة التقليدية.</p><p>يعتبر الحاسوب المزود بلوحة أم جيدة يكون أدائه أسرع من الحاسوب الآخر ذو اللوحة الأم الرديئة حتى ولو كانت المكونات الأخرى مثل الذاكرة العشوائية والمعالج متماثلة لذلك فهي تعتبر أهم قطعة يجب أن تحسن أختيارها عند شراء حاسوب.</p><h2>مكونات اللوحة الأم</h2><p>1.مقبس توصيل الطاقة Power connector</p><p>2.مقبس المعالج CPU Socket</p><p>3.فتحات الذاكرة العشوائية Memory Slots</p><p>4.شريحة البيوس BIOS</p><p>5.فتحات التوسعة EXPANSION SLOTS</p><p>6.طقم الرقاقات chipsets</p><p>7.ىشريحة CMOS</p><p>8.شريحتي Winbond و ITE</p><p>9.دائرة مولد النبضات Timing Signal</p><p>10.دوائر الجهد</p><h2>المكونات الخارجية</h2><p>المنافذ المتوالية Serial Ports</p><p>منافذ PS</p><p>المنافذ المتوازية Parallel Ports</p><p>منافذ USB</p>",
      "objFile": "mb2.obj",
      "mtlFile": "mb2.mtl"
    },
	{
      "id":"system-fan",
      "name": "system fan",
	    "image": "system-fan.JPG",
      "smallDescription": "تبريد الحاسوب (بالإنجليزية: Computer cooling) ضروري للتخلص من الحرارة المتبددة الناتجة عن مكونات الحاسوب، وذلك للحفاظ على المكونات في حدود درجة حرارة التشغيل المسموح بها.",
      "description": "<h2>مروحة النظام</h2><P> تبريد الحاسوب (بالإنجليزية: Computer cooling) ضروري للتخلص من الحرارة المتبددة الناتجة عن مكونات الحاسوب، وذلك للحفاظ على المكونات في حدود درجة حرارة التشغيل المسموح بها.إن المكونات المعرضة للتعطل المؤقت أو التضرر الدائم إذا زادت درجة الحرارة أكثر مما ينبغي تتضمن الدارات المتكاملة مثل، وحدة المعالجة المركزية ومجموعة الشرائح وبطاقة العرض المرئي والأقراص الصلبة.عادةً ما يتم تصميم المكونات لتخرج أقل كمية حرارة ممكنة، وقد يتم تصميم أجهزة الحاسوب وأنظمة التشغيل لتقلل من استهلاك الطاقة وارتفاع درجة الحرارة الناتجة عنه وفقًا لحمل العمل، ولكن قد يتم إخراج كميات من الحرارة تزيد عما يمكن التخلص منه دون الاضطرار إلى تبريده. ويقلل استخدام المشتتات الحرارية التي يتم تبريدها بتدفق الهواء من ارتفاع درجات الحرارة الناتجة عن كمية معينة من الحرارة. قد تساعد مراعاة أنماط تدفق الهواء على الوقاية من حدوث نقاط ساخنة. ويشيع استخدام مراوح أجهزة الحاسوب للتقليل من درجات الحرارة عن طريق طرد الهواء الساخن بشكل مستمر. يوجد أيضًا أساليب أكثر تطرفًا وغرابة، منها التبريد السائل.العديد من أجهزة الحاسوب مصممة لتصدر إنذارًا أو تتوقف عن التشغيل تلقائيًا إذا تخطت درجات الحرارة الداخلية الخطيرة حدًا معينًا.قد يكون التبريد مصممًا لتقليل درجة الحرارة المحيطة داخل علبة الحاسوب، على سبيل المثال عن طريق طرد الهواء الساخن، أو لتبريد مكون واحد أو منطقة صغيرة (التبريد الموضعي). وتتضمن المكونات التي يتم تبريدها بصورة منفردة وحدة المعالجة المركزية (CPU) ووحدة معالجة الرسوميات (GPU) وشريحة نورث بريدج.</P><h2>المكونات المولدة للحرارة غير المرغوب بها</h2><P>إن الدارات المتكاملة (على سبيل المثال، وحدة المعالجة المركزية ووحدة معالجة الرسوميات) هو المكونات المولدة للحرارة الرئيسية في أجهزة الحاسوب الحديثة. من الممكن تقليل توليد الحرارة عن طريق التصميم الفعال وتحديد بارامترات التشغيل مثل الفولتية والتكرارية، ولكن في النهاية يمكن تحقيق الأداء المقبول بالسماح بوجود توليد للحرارة بكميات كبيرة.تراكم الغبار على وحدة المعالجة المركزية في مشتت الحرارة المأخوذ من كمبيوتر محمول بعد 3 سنوات من الاستخدام جعل من المستحيل استخدام الحاسوب المحمول نتيجة عمليات إيقاف التشغيل المتكررة الناتجة عن الحرارة.أثناء التشغيل، ترتفع درجة حرارة مكونات جهاز الحاسوب حتى تصبح الحرارة المنقولة إلى البيئة المحيطة مساوية للحرارة الناتجة عن المكون؛ أي حتى الوصول إلى التوازن الحراري. للحصول على تشغيل فعال، يجب ألا تزيد درجة الحرارة عن القيمة القصوى المحددة المسموح بها لكل مكون. وبالنسبة لأشباه الموصلات، فإن درجة حرارة التقاطع اللحظية هي الحاسمة بدلاً من درجة حرارة علبة المكون أو المشتت الحراري أو درجة الحرارة المحيطة. </P><h2>أنواع مراوح النظام</h2><h2>المراوح المحورية (axial fan) :- </h2> <P>وهى المراوح ذات التصريف المحورى حيث يخرج الهواء منها فى اتجاة محور دوران المروحة وتستخدم المراوح المحورية فى حالة الوحدات ذات الضغط المنخفض للهواء وهذا النوع من المراوح عبارة عن مجموعة من الريش مركبة على العمود وقد تصمم بحيث توضع داخلى مجرى مستدير وتسمى عنئذ (tube axial fan) وقد توضع داخل المجرى ريش ثابتة لتوجيية الهواء الخارج من المروجة فى اتجاة المحور وتسمى مجموعة المروحة والريش الثابتة (vanes axial flow fans) كما يوجد نوع من المراوح المحورية وهى المراوح ذات القرص وتسمى (disc fan) وهذة المراوح تصمم لتعطى معدلات كبيرة من الهواء ولكن هذا الهواء عند ضغط استاتيكى صغير جدا لذلك لا تستخدم فى مجارى الهواء ولكنها تستخدم داخل الغرفة لتحريك الهواء كما انهاة تحدث صوتا مرتفعا . </P><h2>المراوح المركزية </h2><P>تستخدم المراوح المركزية فى الحالات التى تحتاج ضغطا مرتفعا وهى عبارة عن قرص حلقى تركب على محيطة الخارجى ريش وتدور المروحة داخل غلاف خارجى والريش المركبة اما تكون :-- ريش عدلة (straight blade)- ريش مقوسة (curved blade)والتقوس يكون اما فى اتجاة الدوران (forward curved) وتتميز بسرعتها المنخفضة نسبيا , او عكس اتجاة الدوران (backward) وتتميز بسرعتها المرتفعة نسبيا. </P>",
      "objFile": "system-fan.obj",
      "mtlFile": "system-fan.mtl"
    },
    {
      "id":"processor",
      "name": "processor",
	    "image": "processor.JPG",
      "smallDescription": "المعالج في الكمبيوتر هو كالعقل و القلب في جسم الانسان ! :Dاسمه وحدة المعالجة المركزية Central Processing Unit-CPU ، مركزية لأن هناك أماكن أخرى أيضاً تتم فيها عمليات معالجة يقوم بنتفيذ عمليات 'تم وضعها مسبقاً' على البيانات و يظهر المعلومات ، تماماً كالعقل في الانسان ",
      "description": "<h2> ما هو المعالج وما وظيفته وعلى اى اساس يتم اختياره </h2><p> المعالج في الكمبيوتر هو كالعقل و القلب في جسم الانسان ! :Dاسمه وحدة المعالجة المركزية Central Processing Unit-CPU ، مركزية لأن هناك أماكن أخرى أيضاً تتم فيها عمليات معالجة يقوم بنتفيذ عمليات 'تم وضعها مسبقاً' على البيانات و يظهر المعلومات ، تماماً كالعقل في الانسان ، يقوم العقل بحل المعادلة 5*5 بناء على معلومات مسبقة تلقاها في المدرسة ليعطي الحل 25 !و القلب في جسد الانسان ينبض 70 مرة في الدقيقة ليحرك الدم و يغذي الخلايا بينما في المعالج ينبض بسرعات هائلة كـ3000 نبضة في الثانية الواحدة ليغذي أجزاءه بالبيانات ، و في قلب الانسان جزء صغير يولد نبضة كهربية تجعل القلب يعمل ، هذا الجزء الصغير موجود أيضاً في المعالجات و هو يسمى مولد النبضة أو مولد الساعة Clock Generator و هو كالمايسترو في فرقة موسيقية يعطي الاشارة بالتحرك و التوقف للموسيقيين الذين يمثلهم الترانزستورات في المعالج ! و يتم اختياره بحسب سرعته ، الكثير يعتمد على سرعة نبضه لكن هذا غير سليم لأنك قد تجد مثلاً شخصين يركضان و أحدهما قلبه ينبض 60 مرة في الدقيقة و الآخر 70 مرة في الدقيقة و يفوز صاحب قلب الـ60 على صاحب قلب الـ70!في الواقع يجب اختيار المعالج بناء على قدرته الحقيقية التي تظهر في الاختبارات في تنفيذ التعليمات و المسائل الحسابية ، فتجد مثلاً معالجان بسرعة 3000MHz يستطيع أحدهما تنفيذ 15000 مليون تعليمة في الثانية MIPS بينما الآخر قادر على تنفيذ 25000 MIPS يمكن اعتماد الاختبارات المنتشرة على الانترنت في اختيار معالج مناسب ذلك لأنها تظهر قدرته الحقيقية خلف نبضاته !</p><h2> وما هى افضل الشركات المصنعه له ..؟</h2><p> بالنسبة لمعالجات أجهزة الكمبيوتر 'لأن هناك معالجات لاستخدامات أخرى كالتلفزيون و جهاز المحمول!' هناك الكثير من الشركات و أفضلها في هذا المضمار Intel و AMD </p><h2> وما الفرق بين معالج غالى الثمن ومعالج اقل فى الثمن ..؟</h2><p>1- السرعة ، القدرة على تنفيذ عمليات أسرع</p><p>2- المزايا ، كالاختصاص بتعليمات معينة غير متوفرة في معالجات أرخص</p><p>3- حجم الذاكرة كاش أيضاً يؤثر كثيراً في سعر المعالج لأنها 'الـSRAM' هائلة السرعة و غالية الثمن جداً !</p><p>4- التقنية الأحدث</p><h2> هل المعالج فى اداء عمله يعتمد على الرامات او كارت الشاشه ..؟</h2><p> طبعاً المعالج يتأثر أدائه بالذاكرة رام ! تخيل المعالج شخصاً جالساً في مكتبة ضخمة فيها ملايين الكتب التي تحوي مسائل حسابية و هناك شخص آخر عامل في المكتبة - الشخص الجالس في الكرسي و يحل المسائل هو المعالج ! كل ما كان هذا الشخص أسرع كل ما حل مسائل حسابية أكثر !- الطاولة التي يقرأ عليها الشخص المسائل و يحلها هو الذاكرة كاش في المعالج ، كل ما كانت الطاولة 'الذاكرة كاش' أكبر كل ما وضع المعالج أمامه المزيد من المسائل !- الشخص العامل في المكتبة و الذي يحمل الكتب و يضعها على الطاولة أمام الشخص هو الذاكرة رام ! كل ما كان هذا العامل سريعاً و يستطيع حمل المزيد من الكتب كل ما كان الشخص الذي يحل المسائل أسرع في مهمته !- المكتبة الضخمة هي وحدة التخزين 'القرص الصلب ، ذاكرة فلاش ، قرص ليزري...'- الكتب هي الملفات- صفحات الكتب هي البيانات !!اذا كان هناك أي مؤثر على هذا الشخص 'المعالج' يؤثر على أداءه 'كعامل المكتبة البطيء / الذاكرة رام' فسيقل أداء المعالج عن قدرته الحقيقية ، و يسمى هذا في الكمبيوتر 'عنق الزجاجة' ذلك لأن الذي يخنق زجاجة المياه و يمنع سكبها بسرعة هو عنقها ! او كارت الشاشه كرت الشاشة عبارة عن معالج أيضاً له ذاكرته و لكنه متخصص في الرسوم اسمه GPU ، سيقل أداءه 'الـGPU' اذا كان المعالج المركزي 'الـCPU' بطيئاً و لا يجاريه ، و يعتمد GPU على CPU لأن العمليات الحسابية للأطارات الرسومية </p>",
      "objFile": "processor.obj",
      "mtlFile": "processor.mtl"
    },
	{
      "id":"processor-fan",
      "name": "processor fan",
	    "image": "processor-fan.JPG",
      "smallDescription": "تبريد المعالجات أي قطعة إلكترونية في أي جهاز ومنها المعالج تحتاج لأن تعمل ضمن مدى معين من درجات الحرارة التي افترض الصانع أنها ستعمل فيه",
      "description": "<h2>مروحة تبريد المعالج</h2><p>تبريد المعالجات أي قطعة إلكترونية في أي جهاز ومنها المعالج تحتاج لأن تعمل ضمن مدى معين من درجات الحرارة التي افترض الصانع أنها ستعمل فيه</p><h2> الوظيفه</h2><p>تجعل الجهاز يعمل بكفاءه عالية</p><p>تزيد من عمر المعالج</p><p>تسرع أدائه</p><p> تقلل بأخطاء في الحسابات وجميع المعالجات تتطلب طريقة للتبريد ، أما المعالجات 386 وما قبله فلم يكن يلزمه التبريد لأن عدد الترانزسترات لم تكن كبيرة مم يجعل درجة حرارته معتدلة .</p><h2>اهم ما انتبه له عند شراء مروحه تبريد سواء للكيسه او لمشتت المعالج</h2><p>حجم المروحه</p><p>سرعة دوران المروحه</p><p>تدفق الهواء</p><p>الازعاج التي ستعطيه المروحه من دورانها ( Noise ) </p><p>مقبس المروحه</p>",
      "objFile": "processor-fan.obj",
      "mtlFile": "processor-fan.mtl"
    },
    {
      "id":"hard-disk",
      "name": "hard disk",
	    "image": "hard-disk.JPG",
      "smallDescription": "قرص الصلب (بالإنجليزية: Hard Disk أو (Hard Disk Drive (HDD أو Hard Drive أو Fixed Disk) [b] وهو وحدة أو جهاز تخزين بيانات رئيسي في الحاسوب، يستخدم في تخزين وإسترجاع المعلومات الرقمية من وعلى أقراص سريعة الدوران ( قرص سواقة الإسطوانة الصلبة [الإنجليزية] )، وهو يتكون من أقراص ممغنطة تدور ويقوم لاقط كهرومغناطيسي بالقراءة والكتابة من وإلى السطح الممغنط.[2] من أهم الخصائص التي تميز كل قرص صلب عن آخر، سعة التخزين وسرعة الدوران. .",
      "description": "<h2>القرص الصلب</h2><P>قرص الصلب (بالإنجليزية: Hard Disk أو (Hard Disk Drive (HDD أو Hard Drive أو Fixed Disk) [b] وهو وحدة أو جهاز تخزين بيانات رئيسي في الحاسوب، يستخدم في تخزين وإسترجاع المعلومات الرقمية من وعلى أقراص سريعة الدوران ( قرص سواقة الإسطوانة الصلبة [الإنجليزية] )، وهو يتكون من أقراص ممغنطة تدور ويقوم لاقط كهرومغناطيسي بالقراءة والكتابة من وإلى السطح الممغنط.[2] من أهم الخصائص التي تميز كل قرص صلب عن آخر، سعة التخزين وسرعة الدوران. . </P><h2> أساسيات القرص الصلب</h2><P>تم اختراع الأقراص الصلبة في الخمسينيات، وكانت عبارة عن أقراص كبيرة يصل قطرها إلى حوالي 20 بوصة وعلى الرغم من حجمها الكبير إلا أنها كانت تتسع للقليل من الميجا-بايتات. ولم تكن تعرف في ذلك الوقت (بالإنجليزية: Hard disk)، بل كانت تعرف (بالإنجليزية: Fixed disks) أو (بالإنجليزية: Winchesters)، وجاءت التسمية (بالإنجليزية: Hard Disk) بعد ذلك لكي يتم التفرقة بينها وبين الأقراص المرنة.</p><p>وكما هو واضح من اسمه يحتوي القرص الصلب على 'قرص صلب' أو ما يعرف (بالإنجليزية: platter)، هذا القرص توضع عليه المادة المغناطيسية التي تستخدم في حفظ البيانات، هذه المادة المغناطيسية هي نفسها المادة المستخدمة في الأقراص المرنة وشرائط الكاسيت، ولكن الفرق هو أن الأقراص المرنة والكاسيت يتم فيها وضع المادة المغناطيسية علي ماده بلاستيكية مرنة.</p><p>ولكن بشكل عام فان القرص الصلب لا يختلف في طريقه تخزينه للبيانات عن شرائط الكاسيت والأقراص المرنة فكلاهما يستخدم نفس طرق التخزين المغناطيسية، تتميز طرق التخزين المغناطيسية في أنه من السهل الكتابة والمسح وإعادة الكتابة علي المادة المغناطيسية، وكذلك يمكن للمادة المغناطيسية أن تحتفظ بالمعلومات المخزنة عليها لمدة طويلة بسبب أنها تستقطب وتحافظ على شكل استقطابها عند تعرضها لحقل مغناطيسي معين من أداة القراءة والكتابة المغناطيسية.</p><p>يتم تخزين البيانات على القرص الصلب على هيئة صفر وواحد أي ديجيتل (بالإنجليزية: digital)، يقوم الحاسوب بالتعامل معها على شكل بتات (بالإنجليزية: bits)، أي أن كل خانة أو بت، قد تحوي صفر أو واحد فقط أي تحوي نبضة كهربائية أو لا نبضة و في حالة القرص الصلب فإن الذرات المغناطيسية المكونة للقرص الصلب المغناطيسي إما أن تكون مستقطبة في اتجاه (أو شكل معين) أو لا تكون، ويتعامل معها نظام التشغيل على أنها أجزاء أحرف وأوامر حيث أن أي تسلسل معين للأصفار والآحاد قد يكون حرف أو محرف أو أمر تحكمي أو تعليمه برمجية لنظام التشغيل أو خانة لونية (عنصر صورة) بكسل، أي يكون تجمع أو تتالي 8 بتات (خانات) هو بايت واحد (الذي هو حرف واحد أو عنصر واحد من صورة)، ثم يشكل تتالي بايتات نصوصا وصورا وملفات (بالإنجليزية: Files)، فالملفات عبارة عن صفوف من البايتات كي ينفذها الحاسوب أو غيرها من أنواع البيانات التي قد تحتاج إلى تخزين. وعندما يلزم القراءة من القرص الصلب، يقرأ القرص البيانات على شكل blocks مكونة من مجموعة من البايتات يقوم بإرسالها للحاسوب<h2>القرص الصلب (Hard Disk) </h2><P>هو الجزء الأساسي من بنية الحاسوب والمسؤول عن التخزين الطويل الأمد للبيانات حتى في حالة انقطاع التيار الكهربائي عن الجهاز فهو يقوم بقراءة وتسجيل البيانات بطريقه إلكترونية حیث بإمكانه تخزین كمیة كبیرة من البيانات والمعلومات بالإضافة إلى إمكانية قراءة المعلومات والبيانات بصورة اسرع بكثير من أجهزة تخزين البيانات الأخرى مثل: (بالإنجليزية: CD-ROM و Tap drives) وغيرها من الوسائل التخزينية الأخرى كما أن الغالبية العظمى من المساحة التخزينية تستخدم لحفظ البرامج وتخزينها مثل أنظمة التشغيل المختلفة، والبرمجيات المتنوعة، والملفات الشخصية... . </P><h2>البنية الرئيسية للقرص الصلب</h2><P>يتكون القرص الصلب أو الهارد ديسك (بالإنجليزية: Hard Disk) من أربع أجزاء رئيسية:</p><p>الأقراص الدائرية.</p><p>محور دوران.</p><p>رؤوس القراءة/الكتابة.</p><p>مجموعة من الدوائر الإلكترونية. . </P><h3>الأقراص (الأطباق الدائرية Platters) </h3><P>هي مجموعة من الأقراص المتصلبة الدائرية الشكل مصنوعة من المعدن أو البلاستيك ووجهي كل قرص مغطى بطبقة من أكسيد الحديد أو أي مادة أخرى قابلة للمغنطة وكل الأقراص مثبتة من مركزها على محور دوران يعمل على تدوير كل الأقراص بنفس السرعة. . </P><h3>رؤوس القراءة/الكتابة Read/write heads</h3><P>تثبت رؤوس القراءة/الكتابة على ذراع أفقي يمتد على كل من السطحين العلوي والسفلي لكل واحدة من الأقراص الدائرية والذراع الأفقي يتحرك ذهاباُ وإياباً بين مركز الأقراص وحافتها الخارجية وبسرعة كبيرة وهذه الحركة مع حركة دوران الأقراص الدائرية تسمح لرؤوس القراءة/الكتابة بالوصول إلى أي نقطة على سطح الأقراص. . </P><h2>الدوائر الإلكترونية Electronic circles</h2><P>تترجم الدوائر الإلكترونية الأوامر الصادرة عن الكمبيوتر ثم تقوم على ضوء تلك الأوامر بتحريك رؤوس القراءة/الكتابة إلى مكان معين على الأقراص مما يسمح لرؤوس القراءة/الكتابة بقراءة، أو كتابة البيانات المطلوبة</P><h2>أنواع الأقراص الصلبة</h2><P>الحواسب الحديثة تتعامل مع نوع واحد أو أكثر من الأقراص الصلبة التالية :</P><h3>AT Attachment (ATA):</h3><p>من أشهر أنواع الأقراص الصلبة ويطلق عليها Parallel ATA أو PATA كما يطلق عليه أيضا IDE (Integrated Drive Electronics).</p><h3>(Serial ATA SATA):</h3><p>هذا النوع ظهر مؤخرا ليستبدل النوع الأول وهو يتفوق على pata من عدة نواحي منها أن الكبل الذي يتم توصيله باللوحة الأم أطول يعطي حرية أكبر كما أنه أصغر حجما فلا يعوق عملية التهوية في صندوق الحاسب كما يتميز بأنه أسرع من pata.</p><h3>EXTERNAL USB 2.0 Drives:</h3><p>هذا النوع من أكثر الأنواع مرونة حيث يسمح بتوصيله بفتحة يو إس بي، في أى لوحة أم ومن مميزاته إمكانية التنقل به بسهولة</p><h3>SCSI:</h3><p>و غالبا ما يستخدم في أجهزة الحواسب الكبيرة التي تعمل كخوادم (بالإنجليزية: Servers)، يتميز بأدائه العالي جدا الذي يتفوق به على الأنواع الأخرى كما يسمح بتوصيل عدة أقراص على كارت سكزي (SCSI) واحد إلا أن سعره العالي لا يجعله في متناول الجميع. .</p><h2>العوامل المؤثرة على الأقراص الصلبة</h2><P>معدل نقل البيانات (بالإنجليزية: Data rate) هو عدد الـ Bytes التي يتم نقلها من القرص الصلب إلى ذاكرة الوصول العشوائي في الثانية الواحدة، ويتراوح بين 5 إلى 40 ميجا-بايت في الثانية الواحدة وهي في ازدياد مع التقدم التقني.</p><p>زمن الوصول (بالإنجليزية: Seek Time) هو الزمن المستغرق بين طلب الملف من القرص الصلب ووصول أول Byte من الملف إلى ذاكرة الوصول العشوائي Ram.</p><p>سرعة دوران القرص الصلب، فكلما كانت سرعة الدوران أعلي كان ذلك أفضل.</p><p>نوع الـ Interface الذي يستخدمه القرص الصلب.</p><p>الكثافة التخزينية، وهي عدد البايتات (Bytes) التي يمكن تخزينها في مساحة معينة من القرص الصلب.</p><p>وطبعا الأهم من ذلك السعة (بالإنجليزية: Capacity) الكلية للقرص الصلب مثلا: 20، 40، 80، 120، 160، 250، 320، 500، 640، 750، 1000، 2000 جيجابايت. . </P>",
      "objFile": "hard-desk.obj",
      "mtlFile": "hard-desk.mtl"
    }
  ]
}
